#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>

// 求a和b的最小公倍数  a和b相乘除以最大公约数也是最小公倍数
//int main()
//{
//	int a = 0;
//	int b = 0;
//	scanf("%d %d", &a, &b);
//
//	int i = 1;
//	while (1)
//	{
//		if (a*i%b == 0)
//		{
//			printf("%d\n", a * i);
//			break;
//		}
//		i++;
//	}
//
//	return 0;
//}


// 辗转相除法求最大公约数
//int main()
//{
//	int a = 0;
//	int b = 0;
//	int r = 0;
//
//	scanf("%d %d", &a, &b);
//	while (r = a % b)
//	{
//		a = b;
//		b = r;
//	}
//
//	printf("最大公约数为：%d\n", b);
//
//	return 0;
//}




//void reverse(char* left, char* right)
//{
//	while (left < right)
//	{
//		char tmp = 0;
//		tmp = *left;
//		*left = *right;
//		*right = tmp;
//		left++;
//		right--;
//	}
//}

// 倒置字符串的内容，将一句话的单词进行倒置，标点不倒置。如 I like beijing. ， beijing. like I
// 依次输出倒置之后的字符串，以空格分隔
#include <string.h>
//int main()
//{
//	char arr[100] = { 0 };
//	gets(arr);
//
//	// 三步翻转法
//	// 1.字符串整体逆序  I like beijing.
//	// .gnijied ekil I
//
//	int len = strlen(arr);
//
//	reverse(arr, arr+len-1);
//
//	// 2.每个单词再逆序
//	char* start = arr;  // 起始位置
//	while (*start)
//	{
//		char* end = start; 
//		while (*end != ' ' && *end != '\0')
//		{
//			end++;
//		}
//		// 逆序一个单词
//		reverse(start, end-1);
//		if (*end == ' ')
//		{
//			start = end + 1;
//		}
//		else
//		{
//			start = end;
//		}
//	}
//
//	printf("%s\n", arr);
//
//	return 0;
//}




// 判断机器是小端存储还是大端存储
//int main()
//{
//	int a = 1;
//
//	char* p = (char*)&a;
//
//	if (*p == 1)
//	{
//		printf("小端\n");
//	}
//	else
//	{
//		printf("大端\n");
//	}
//
//	return 0;
//}






//int main()
//{
//	char a = -1;
//	//10000000000000000000000000000001  原码
//	//11111111111111111111111111111110	反码
//	//11111111111111111111111111111111	补码
//	//11111111							截断  a里面存的
//	//11111111111111111111111111111111	整型提升（有符号的整型提升高位补符号位）
//	signed char b = -1;
//	//11111111
//	unsigned char c = -1;
//	//11111111
//	//00000000000000000000000011111111	无符号整型提升高位补0
//	printf("a = %d,b = %d,c = %d\n", a, b, c); // -1  -1  255
//
//	return 0;
//}
/*
	补充：char类型到底是signed char还是unsigned char？	C语言标准并没有规定，取决于编译器。大部分都是 signed cahr
*/




//int main()
//{
//	char a = -128;
//	//10000000000000000000000010000000
//	//11111111111111111111111101111111
//	//11111111111111111111111110000000
//	//10000000
//	//11111111111111111111111110000000	整型提升（a是有符号数，整型提升高位补1）
//	printf("%u\n", a);  // 4294967168
//
//	return 0;
//}





//int main()
//{
//	char a = 128;
//	//0000000000000000000000000000000010000000
//	//0000000000000000000000000000000010000000
//	//0000000000000000000000000000000010000000
//	//10000000
//	//1111111111111111111111111111111110000000
//	printf("%u\n", a);
//
//	return 0;
//}





//int main()
//{
//	int i = -20;
//	//10000000000000000000000000010100
//	//11111111111111111111111111101011
//	//11111111111111111111111111101100
//	unsigned int j = 10;
//	//00000000000000000000000000001010
//	//11111111111111111111111111101100
//	//11111111111111111111111111110110
//
//	//10000000000000000000000000001001   +1
//	//10000000000000000000000000001010
//	printf("%d\n", i + j);  // -10
//
//	return 0;
//}

/*
	补充：
		一个无符号数加上一个有符号数，会先将有符号数转化为无符号数再相加
int main()
{
	int i = -20;
	unsigned int j = 10;

	if (i + j > 0)
	{
		printf("hehe\n");
	}

	return 0;
}

*/






//int main()
//{
//	unsigned int i;
//	for (i = 9; i >= 0; i--)
//	{
//		printf("%u\n", i);   // 死循环  i是无符号数
//	}
//}





//int main()
//{
//	char a[1000];
//	int i;
//	for (i = 0; i < 1000; i++)
//	{
//		a[i] = -1 - i;
//	}
//
//	printf("%d\n", strlen(a));   // 255
//
//	return 0;
//}




//unsigned char i = 0;
//int main()
//{
//	for (i = 0; i <= 255; i++)
//	{
//	
//		printf("hello world\n");   // 死循环
//	}
//
//	return 0;
//}
